nxp-mcuxpresso/mcux-devices-rt/RT1180/MIMXRT1185/iar/startup_MIMXRT1185_cm7.s
        DCD     TMR2_IRQHandler                               ;TMR2 interrupt
        DCD     GPIO5_IRQHandler                              ;GPIO5 interrupt
        DCD     ASRC_IRQHandler                               ;ASRC interrupt
        DCD     GPIO6_IRQHandler                              ;GPIO6 interrupt
        DCD     DBG_TRACE_IRQHandler                          ;JTAGSW DAP MDM-AP SRC reset source
        DCD     Reserved254_IRQHandler                        ;Reserved interrupt
        DCD     0xFFFFFFFF                                    ; Reserved for user TRIM value
__Vectors_End

__Vectors       EQU   __vector_table
__Vectors_Size  EQU   __Vectors_End - __Vectors


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; Default interrupt handlers.
;;
        THUMB

        PUBWEAK Reset_Handler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reset_Handler
        CPSID   I               ; Mask interrupts
        LDR     R0, =0xE000ED08
        LDR     R1, =__vector_table
        STR     R1, [R0]
        LDR     R2, [R1]
        MSR     MSP, R2
        LDR     R0, =SystemInit
        BLX     R0

; Start STACK/HEAP initializaiton
        MOV    R0, #0

        LDR    R1, =SFB(HEAP)
        LDR    R2, =SFE(HEAP)
.LC1:
        CMP    R1, R2
        ITT    LT
        STRLT  R0, [R1], #4
        BLT    .LC1

        LDR     R1, =SFB(CSTACK)
        LDR     R2, =SFE(CSTACK)
.LC2:
        CMP     R1, R2
        ITT     LT
        STRLT   R0, [R1], #4
        BLT     .LC2
; End STACK/HEAP initialization

        CPSIE   I               ; Unmask interrupts
        LDR     R0, =__iar_program_start
        BX      R0

        PUBWEAK NMI_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
NMI_Handler
        B .

        PUBWEAK HardFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
HardFault_Handler
        B .

        PUBWEAK MemManage_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MemManage_Handler
        B .

        PUBWEAK BusFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
BusFault_Handler
        B .

        PUBWEAK UsageFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UsageFault_Handler
        B .

        PUBWEAK SVC_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SVC_Handler
        B .

        PUBWEAK DebugMon_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
DebugMon_Handler
        B .

        PUBWEAK PendSV_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
PendSV_Handler
        B .

        PUBWEAK SysTick_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SysTick_Handler
        B .

        PUBWEAK TMR1_IRQHandler
        PUBWEAK DAP_IRQHandler
        PUBWEAK M7_CTI_TRIGGER_OUTPUT_IRQHandler
        PUBWEAK M33_CTI_TRIGGER_OUTPUT_IRQHandler
        PUBWEAK TMR5_IRQHandler
        PUBWEAK TMR6_IRQHandler
        PUBWEAK TMR7_IRQHandler
        PUBWEAK TMR8_IRQHandler
        PUBWEAK CAN1_IRQHandler
        PUBWEAK CAN1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN1_IRQHandler
        LDR     R0, =CAN1_DriverIRQHandler
        BX      R0

        PUBWEAK CAN1_ERROR_IRQHandler
        PUBWEAK CAN1_ERROR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN1_ERROR_IRQHandler
        LDR     R0, =CAN1_ERROR_DriverIRQHandler
        BX      R0

        PUBWEAK GPIO1_0_IRQHandler
        PUBWEAK GPIO1_1_IRQHandler
        PUBWEAK I3C1_IRQHandler
        PUBWEAK I3C1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
I3C1_IRQHandler
        LDR     R0, =I3C1_DriverIRQHandler
        BX      R0

        PUBWEAK LPI2C1_IRQHandler
        PUBWEAK LPI2C1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPI2C1_IRQHandler
        LDR     R0, =LPI2C1_DriverIRQHandler
        BX      R0

        PUBWEAK LPI2C2_IRQHandler
        PUBWEAK LPI2C2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPI2C2_IRQHandler
        LDR     R0, =LPI2C2_DriverIRQHandler
        BX      R0

        PUBWEAK LPIT1_IRQHandler
        PUBWEAK LPSPI1_IRQHandler
        PUBWEAK LPSPI1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPSPI1_IRQHandler
        LDR     R0, =LPSPI1_DriverIRQHandler
        BX      R0

        PUBWEAK LPSPI2_IRQHandler
        PUBWEAK LPSPI2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPSPI2_IRQHandler
        LDR     R0, =LPSPI2_DriverIRQHandler
        BX      R0

        PUBWEAK LPTMR1_IRQHandler
        PUBWEAK LPUART1_IRQHandler
        PUBWEAK LPUART1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART1_IRQHandler
        LDR     R0, =LPUART1_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART2_IRQHandler
        PUBWEAK LPUART2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART2_IRQHandler
        LDR     R0, =LPUART2_DriverIRQHandler
        BX      R0

        PUBWEAK MU1_IRQHandler
        PUBWEAK MU2_IRQHandler
        PUBWEAK PWM1_FAULT_IRQHandler
        PUBWEAK PWM1_0_IRQHandler
        PUBWEAK PWM1_1_IRQHandler
        PUBWEAK PWM1_2_IRQHandler
        PUBWEAK PWM1_3_IRQHandler
        PUBWEAK EDGELOCK_TRUST_MUA_RX_FULL_IRQHandler
        PUBWEAK EDGELOCK_TRUST_MUA_TX_EMPTY_IRQHandler
        PUBWEAK EDGELOCK_APPS_CORE_MUA_RX_FULL_IRQHandler
        PUBWEAK EDGELOCK_APPS_CORE_MUA_TX_EMPTY_IRQHandler
        PUBWEAK EDGELOCK_REALTIME_CORE_MUA_RX_FULL_IRQHandler
        PUBWEAK EDGELOCK_REALTIME_CORE_MUA_TX_EMPTY_IRQHandler
        PUBWEAK EDGELOCK_SECURE_IRQHandler
        PUBWEAK EDGELOCK_NONSECURE_IRQHandler
        PUBWEAK TPM1_IRQHandler
        PUBWEAK TPM2_IRQHandler
        PUBWEAK RTWDOG1_IRQHandler
        PUBWEAK RTWDOG2_IRQHandler
        PUBWEAK TRDC_MGR_AON_IRQHandler
        PUBWEAK PDM_HWVAD_EVENT_IRQHandler
        PUBWEAK PDM_HWVAD_EVENT_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PDM_HWVAD_EVENT_IRQHandler
        LDR     R0, =PDM_HWVAD_EVENT_DriverIRQHandler
        BX      R0

        PUBWEAK PDM_HWVAD_ERROR_IRQHandler
        PUBWEAK PDM_HWVAD_ERROR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PDM_HWVAD_ERROR_IRQHandler
        LDR     R0, =PDM_HWVAD_ERROR_DriverIRQHandler
        BX      R0

        PUBWEAK PDM_EVENT_IRQHandler
        PUBWEAK PDM_EVENT_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PDM_EVENT_IRQHandler
        LDR     R0, =PDM_EVENT_DriverIRQHandler
        BX      R0

        PUBWEAK PDM_ERROR_IRQHandler
        PUBWEAK PDM_ERROR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
PDM_ERROR_IRQHandler
        LDR     R0, =PDM_ERROR_DriverIRQHandler
        BX      R0

        PUBWEAK SAI1_IRQHandler
        PUBWEAK SAI1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SAI1_IRQHandler
        LDR     R0, =SAI1_DriverIRQHandler
        BX      R0

        PUBWEAK CM33_PS_IRQHandler
        PUBWEAK CM33_TCM_ECC_IRQHandler
        PUBWEAK CM33_TCM_ERROR_IRQHandler
        PUBWEAK CM7_TCM_ECC_IRQHandler
        PUBWEAK CM7_TCM_ERROR_IRQHandler
        PUBWEAK Reserved67_IRQHandler
        PUBWEAK Reserved68_IRQHandler
        PUBWEAK FLEXIO1_IRQHandler
        PUBWEAK FLEXIO1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXIO1_IRQHandler
        LDR     R0, =FLEXIO1_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXIO2_IRQHandler
        PUBWEAK FLEXIO2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXIO2_IRQHandler
        LDR     R0, =FLEXIO2_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXSPI1_IRQHandler
        PUBWEAK FLEXSPI1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXSPI1_IRQHandler
        LDR     R0, =FLEXSPI1_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXSPI2_IRQHandler
        PUBWEAK FLEXSPI2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXSPI2_IRQHandler
        LDR     R0, =FLEXSPI2_DriverIRQHandler
        BX      R0

        PUBWEAK GPIO2_0_IRQHandler
        PUBWEAK GPIO2_1_IRQHandler
        PUBWEAK GPIO3_0_IRQHandler
        PUBWEAK GPIO3_1_IRQHandler
        PUBWEAK I3C2_IRQHandler
        PUBWEAK I3C2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
I3C2_IRQHandler
        LDR     R0, =I3C2_DriverIRQHandler
        BX      R0

        PUBWEAK LPI2C3_IRQHandler
        PUBWEAK LPI2C3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPI2C3_IRQHandler
        LDR     R0, =LPI2C3_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved79_IRQHandler
        PUBWEAK LPIT2_IRQHandler
        PUBWEAK LPSPI3_IRQHandler
        PUBWEAK LPSPI3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPSPI3_IRQHandler
        LDR     R0, =LPSPI3_DriverIRQHandler
        BX      R0

        PUBWEAK LPSPI4_IRQHandler
        PUBWEAK LPSPI4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPSPI4_IRQHandler
        LDR     R0, =LPSPI4_DriverIRQHandler
        BX      R0

        PUBWEAK LPTMR2_IRQHandler
        PUBWEAK LPUART3_IRQHandler
        PUBWEAK LPUART3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART3_IRQHandler
        LDR     R0, =LPUART3_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART4_IRQHandler
        PUBWEAK LPUART4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART4_IRQHandler
        LDR     R0, =LPUART4_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART5_IRQHandler
        PUBWEAK LPUART5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART5_IRQHandler
        LDR     R0, =LPUART5_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART6_IRQHandler
        PUBWEAK LPUART6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART6_IRQHandler
        LDR     R0, =LPUART6_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved88_IRQHandler
        PUBWEAK BBNSM_IRQHandler
        PUBWEAK SYS_CTR1_IRQHandler
        PUBWEAK TPM3_IRQHandler
        PUBWEAK TPM4_IRQHandler
        PUBWEAK Reserved93_IRQHandler
        PUBWEAK Reserved94_IRQHandler
        PUBWEAK RTWDOG3_IRQHandler
        PUBWEAK RTWDOG4_IRQHandler
        PUBWEAK RTWDOG5_IRQHandler
        PUBWEAK TRDC_MGR_WKUP_IRQHandler
        PUBWEAK TMPSNS_INT_IRQHandler
        PUBWEAK BBSM_IRQHandler
        PUBWEAK LDO_AON_ANA_IRQHandler
        PUBWEAK Reserved102_IRQHandler
        PUBWEAK USDHC2_IRQHandler
        PUBWEAK USDHC2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
USDHC2_IRQHandler
        LDR     R0, =USDHC2_DriverIRQHandler
        BX      R0

        PUBWEAK TRDC_MGR_MEGA_IRQHandler
        PUBWEAK SFA_IRQHandler
        PUBWEAK LDO_AON_DIG_IRQHandler
        PUBWEAK MECC1_IRQHandler
        PUBWEAK MECC2_IRQHandler
        PUBWEAK ADC1_IRQHandler
        PUBWEAK DMA_ERROR_IRQHandler
        PUBWEAK DMA_ERROR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_ERROR_IRQHandler
        LDR     R0, =DMA_ERROR_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH0_IRQHandler
        PUBWEAK DMA3_CH0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH0_IRQHandler
        LDR     R0, =DMA3_CH0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH1_IRQHandler
        PUBWEAK DMA3_CH1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH1_IRQHandler
        LDR     R0, =DMA3_CH1_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH2_IRQHandler
        PUBWEAK DMA3_CH2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH2_IRQHandler
        LDR     R0, =DMA3_CH2_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH3_IRQHandler
        PUBWEAK DMA3_CH3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH3_IRQHandler
        LDR     R0, =DMA3_CH3_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH4_IRQHandler
        PUBWEAK DMA3_CH4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH4_IRQHandler
        LDR     R0, =DMA3_CH4_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH5_IRQHandler
        PUBWEAK DMA3_CH5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH5_IRQHandler
        LDR     R0, =DMA3_CH5_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH6_IRQHandler
        PUBWEAK DMA3_CH6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH6_IRQHandler
        LDR     R0, =DMA3_CH6_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH7_IRQHandler
        PUBWEAK DMA3_CH7_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH7_IRQHandler
        LDR     R0, =DMA3_CH7_DriverIRQHandler
        BX      R0

