nxp-mcuxpresso/mcux-devices-rt/RT1180/MIMXRT1185/iar/startup_MIMXRT1185_cm7.s
        PUBWEAK DMA4_CH16_CH17_CH48_CH49_IRQHandler
        PUBWEAK DMA4_CH16_CH17_CH48_CH49_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH16_CH17_CH48_CH49_IRQHandler
        LDR     R0, =DMA4_CH16_CH17_CH48_CH49_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH18_CH19_CH50_CH51_IRQHandler
        PUBWEAK DMA4_CH18_CH19_CH50_CH51_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH18_CH19_CH50_CH51_IRQHandler
        LDR     R0, =DMA4_CH18_CH19_CH50_CH51_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH20_CH21_CH52_CH53_IRQHandler
        PUBWEAK DMA4_CH20_CH21_CH52_CH53_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH20_CH21_CH52_CH53_IRQHandler
        LDR     R0, =DMA4_CH20_CH21_CH52_CH53_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH22_CH23_CH54_CH55_IRQHandler
        PUBWEAK DMA4_CH22_CH23_CH54_CH55_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH22_CH23_CH54_CH55_IRQHandler
        LDR     R0, =DMA4_CH22_CH23_CH54_CH55_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH24_CH25_CH56_CH57_IRQHandler
        PUBWEAK DMA4_CH24_CH25_CH56_CH57_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH24_CH25_CH56_CH57_IRQHandler
        LDR     R0, =DMA4_CH24_CH25_CH56_CH57_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH26_CH27_CH58_CH59_IRQHandler
        PUBWEAK DMA4_CH26_CH27_CH58_CH59_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH26_CH27_CH58_CH59_IRQHandler
        LDR     R0, =DMA4_CH26_CH27_CH58_CH59_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH28_CH29_CH60_CH61_IRQHandler
        PUBWEAK DMA4_CH28_CH29_CH60_CH61_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH28_CH29_CH60_CH61_IRQHandler
        LDR     R0, =DMA4_CH28_CH29_CH60_CH61_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH30_CH31_CH62_CH63_IRQHandler
        PUBWEAK DMA4_CH30_CH31_CH62_CH63_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH30_CH31_CH62_CH63_IRQHandler
        LDR     R0, =DMA4_CH30_CH31_CH62_CH63_DriverIRQHandler
        BX      R0

        PUBWEAK XBAR1_CH0_CH1_IRQHandler
        PUBWEAK XBAR1_CH2_CH3_IRQHandler
        PUBWEAK SINC3_CH0_CH1_CH2_CH3_IRQHandler
        PUBWEAK EWM_IRQHandler
        PUBWEAK SEMC_IRQHandler
        PUBWEAK LPIT3_IRQHandler
        PUBWEAK LPTMR3_IRQHandler
        PUBWEAK TMR4_IRQHandler
        PUBWEAK Reserved168_IRQHandler
        PUBWEAK LPI2C6_IRQHandler
        PUBWEAK LPI2C6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPI2C6_IRQHandler
        LDR     R0, =LPI2C6_DriverIRQHandler
        BX      R0

        PUBWEAK SAI4_IRQHandler
        PUBWEAK SAI4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SAI4_IRQHandler
        LDR     R0, =SAI4_DriverIRQHandler
        BX      R0

        PUBWEAK SPDIF_IRQHandler
        PUBWEAK SPDIF_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SPDIF_IRQHandler
        LDR     R0, =SPDIF_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved172_IRQHandler
        PUBWEAK Reserved173_IRQHandler
        PUBWEAK Reserved174_IRQHandler
        PUBWEAK Reserved175_IRQHandler
        PUBWEAK INTG_BOOTROM_DEBUG_CTRL_IRQHandler
        PUBWEAK EDGELOCK_REQ1_IRQHandler
        PUBWEAK EDGELOCK_REQ2_IRQHandler
        PUBWEAK EDGELOCK_REQ3_IRQHandler
        PUBWEAK TMR3_IRQHandler
        PUBWEAK JTAGC_IRQHandler
        PUBWEAK M33_SYSRESET_REQ_IRQHandler
        PUBWEAK M33_LOCKUP_IRQHandler
        PUBWEAK M7_SYSRESET_REQ_IRQHandler
        PUBWEAK M7_LOCKUP_IRQHandler
        PUBWEAK PWM2_FAULT_IRQHandler
        PUBWEAK PWM2_0_IRQHandler
        PUBWEAK PWM2_1_IRQHandler
        PUBWEAK PWM2_2_IRQHandler
        PUBWEAK PWM2_3_IRQHandler
        PUBWEAK PWM3_FAULT_IRQHandler
        PUBWEAK PWM3_0_IRQHandler
        PUBWEAK PWM3_1_IRQHandler
        PUBWEAK PWM3_2_IRQHandler
        PUBWEAK PWM3_3_IRQHandler
        PUBWEAK PWM4_FAULT_IRQHandler
        PUBWEAK PWM4_0_IRQHandler
        PUBWEAK PWM4_1_IRQHandler
        PUBWEAK PWM4_2_IRQHandler
        PUBWEAK PWM4_3_IRQHandler
        PUBWEAK EQDC1_IRQHandler
        PUBWEAK EQDC2_IRQHandler
        PUBWEAK EQDC3_IRQHandler
        PUBWEAK EQDC4_IRQHandler
        PUBWEAK ADC2_IRQHandler
        PUBWEAK DCDC_IRQHandler
        PUBWEAK CAN3_IRQHandler
        PUBWEAK CAN3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN3_IRQHandler
        LDR     R0, =CAN3_DriverIRQHandler
        BX      R0

        PUBWEAK CAN3_ERROR_IRQHandler
        PUBWEAK CAN3_ERROR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
CAN3_ERROR_IRQHandler
        LDR     R0, =CAN3_ERROR_DriverIRQHandler
        BX      R0

        PUBWEAK DAC_IRQHandler
        PUBWEAK LPSPI5_IRQHandler
        PUBWEAK LPSPI5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPSPI5_IRQHandler
        LDR     R0, =LPSPI5_DriverIRQHandler
        BX      R0

        PUBWEAK LPSPI6_IRQHandler
        PUBWEAK LPSPI6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPSPI6_IRQHandler
        LDR     R0, =LPSPI6_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART7_IRQHandler
        PUBWEAK LPUART7_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART7_IRQHandler
        LDR     R0, =LPUART7_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART8_IRQHandler
        PUBWEAK LPUART8_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART8_IRQHandler
        LDR     R0, =LPUART8_DriverIRQHandler
        BX      R0

        PUBWEAK SAI2_IRQHandler
        PUBWEAK SAI2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SAI2_IRQHandler
        LDR     R0, =SAI2_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved215_IRQHandler
        PUBWEAK Reserved216_IRQHandler
        PUBWEAK Reserved217_IRQHandler
        PUBWEAK ACMP3_IRQHandler
        PUBWEAK Reserved219_IRQHandler
        PUBWEAK CM7_PS_IRQHandler
        PUBWEAK CM7_MCM_IRQHandler
        PUBWEAK CM33_MCM_IRQHandler
        PUBWEAK Reserved223_IRQHandler
        PUBWEAK SAFETY_CLK_MON_IRQHandler
        PUBWEAK GPT1_IRQHandler
        PUBWEAK GPT2_IRQHandler
        PUBWEAK KPP_IRQHandler
        PUBWEAK USBPHY1_IRQHandler
        PUBWEAK Reserved229_IRQHandler
        PUBWEAK Reserved230_IRQHandler
        PUBWEAK USB_OTG1_IRQHandler
        PUBWEAK FLEXSPI_SLV_IRQHandler
        PUBWEAK FLEXSPI_SLV_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXSPI_SLV_IRQHandler
        LDR     R0, =FLEXSPI_SLV_DriverIRQHandler
        BX      R0

        PUBWEAK NETC_IRQHandler
        PUBWEAK MSGINTR1_IRQHandler
        PUBWEAK MSGINTR2_IRQHandler
        PUBWEAK MSGINTR3_IRQHandler
        PUBWEAK MSGINTR4_IRQHandler
        PUBWEAK MSGINTR5_IRQHandler
        PUBWEAK MSGINTR6_IRQHandler
        PUBWEAK SINC1_CH0_IRQHandler
        PUBWEAK SINC1_CH1_IRQHandler
        PUBWEAK SINC1_CH2_IRQHandler
        PUBWEAK SINC1_CH3_IRQHandler
        PUBWEAK SINC2_CH0_IRQHandler
        PUBWEAK SINC2_CH1_IRQHandler
        PUBWEAK SINC2_CH2_IRQHandler
        PUBWEAK SINC2_CH3_IRQHandler
        PUBWEAK GPIO4_IRQHandler
        PUBWEAK TMR2_IRQHandler
        PUBWEAK GPIO5_IRQHandler
        PUBWEAK ASRC_IRQHandler
        PUBWEAK ASRC_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ASRC_IRQHandler
        LDR     R0, =ASRC_DriverIRQHandler
        BX      R0

        PUBWEAK GPIO6_IRQHandler
        PUBWEAK DBG_TRACE_IRQHandler
        PUBWEAK Reserved254_IRQHandler
        PUBWEAK DefaultISR
        SECTION .text:CODE:REORDER:NOROOT(1)
TMR1_IRQHandler
DAP_IRQHandler
M7_CTI_TRIGGER_OUTPUT_IRQHandler
M33_CTI_TRIGGER_OUTPUT_IRQHandler
TMR5_IRQHandler
TMR6_IRQHandler
TMR7_IRQHandler
TMR8_IRQHandler
CAN1_DriverIRQHandler
CAN1_ERROR_DriverIRQHandler
GPIO1_0_IRQHandler
GPIO1_1_IRQHandler
I3C1_DriverIRQHandler
LPI2C1_DriverIRQHandler
LPI2C2_DriverIRQHandler
LPIT1_IRQHandler
LPSPI1_DriverIRQHandler
LPSPI2_DriverIRQHandler
LPTMR1_IRQHandler
LPUART1_DriverIRQHandler
LPUART2_DriverIRQHandler
MU1_IRQHandler
MU2_IRQHandler
PWM1_FAULT_IRQHandler
PWM1_0_IRQHandler
PWM1_1_IRQHandler
PWM1_2_IRQHandler
PWM1_3_IRQHandler
EDGELOCK_TRUST_MUA_RX_FULL_IRQHandler
EDGELOCK_TRUST_MUA_TX_EMPTY_IRQHandler
EDGELOCK_APPS_CORE_MUA_RX_FULL_IRQHandler
EDGELOCK_APPS_CORE_MUA_TX_EMPTY_IRQHandler
EDGELOCK_REALTIME_CORE_MUA_RX_FULL_IRQHandler
EDGELOCK_REALTIME_CORE_MUA_TX_EMPTY_IRQHandler
EDGELOCK_SECURE_IRQHandler
EDGELOCK_NONSECURE_IRQHandler
TPM1_IRQHandler
TPM2_IRQHandler
RTWDOG1_IRQHandler
RTWDOG2_IRQHandler
TRDC_MGR_AON_IRQHandler
PDM_HWVAD_EVENT_DriverIRQHandler
PDM_HWVAD_ERROR_DriverIRQHandler
PDM_EVENT_DriverIRQHandler
PDM_ERROR_DriverIRQHandler
SAI1_DriverIRQHandler
CM33_PS_IRQHandler
CM33_TCM_ECC_IRQHandler
CM33_TCM_ERROR_IRQHandler
CM7_TCM_ECC_IRQHandler
CM7_TCM_ERROR_IRQHandler
Reserved67_IRQHandler
Reserved68_IRQHandler
FLEXIO1_DriverIRQHandler
FLEXIO2_DriverIRQHandler
FLEXSPI1_DriverIRQHandler
FLEXSPI2_DriverIRQHandler
GPIO2_0_IRQHandler
GPIO2_1_IRQHandler
GPIO3_0_IRQHandler
GPIO3_1_IRQHandler
I3C2_DriverIRQHandler
LPI2C3_DriverIRQHandler
Reserved79_IRQHandler
LPIT2_IRQHandler
LPSPI3_DriverIRQHandler
LPSPI4_DriverIRQHandler
LPTMR2_IRQHandler
LPUART3_DriverIRQHandler
LPUART4_DriverIRQHandler
LPUART5_DriverIRQHandler
LPUART6_DriverIRQHandler
Reserved88_IRQHandler
BBNSM_IRQHandler
SYS_CTR1_IRQHandler
TPM3_IRQHandler
TPM4_IRQHandler
Reserved93_IRQHandler
Reserved94_IRQHandler
RTWDOG3_IRQHandler
RTWDOG4_IRQHandler
RTWDOG5_IRQHandler
TRDC_MGR_WKUP_IRQHandler
TMPSNS_INT_IRQHandler
BBSM_IRQHandler
LDO_AON_ANA_IRQHandler
Reserved102_IRQHandler
USDHC2_DriverIRQHandler
TRDC_MGR_MEGA_IRQHandler
SFA_IRQHandler
LDO_AON_DIG_IRQHandler
MECC1_IRQHandler
MECC2_IRQHandler
ADC1_IRQHandler
DMA_ERROR_DriverIRQHandler
DMA3_CH0_DriverIRQHandler
DMA3_CH1_DriverIRQHandler
DMA3_CH2_DriverIRQHandler
DMA3_CH3_DriverIRQHandler
DMA3_CH4_DriverIRQHandler
DMA3_CH5_DriverIRQHandler
DMA3_CH6_DriverIRQHandler
DMA3_CH7_DriverIRQHandler
DMA3_CH8_DriverIRQHandler
DMA3_CH9_DriverIRQHandler
DMA3_CH10_DriverIRQHandler
DMA3_CH11_DriverIRQHandler
DMA3_CH12_DriverIRQHandler
DMA3_CH13_DriverIRQHandler
DMA3_CH14_DriverIRQHandler
DMA3_CH15_DriverIRQHandler
DMA3_CH16_DriverIRQHandler
DMA3_CH17_DriverIRQHandler
DMA3_CH18_DriverIRQHandler
DMA3_CH19_DriverIRQHandler
DMA3_CH20_DriverIRQHandler
DMA3_CH21_DriverIRQHandler
DMA3_CH22_DriverIRQHandler
DMA3_CH23_DriverIRQHandler
DMA3_CH24_DriverIRQHandler
DMA3_CH25_DriverIRQHandler
DMA3_CH26_DriverIRQHandler
DMA3_CH27_DriverIRQHandler
DMA3_CH28_DriverIRQHandler
DMA3_CH29_DriverIRQHandler
DMA3_CH30_DriverIRQHandler
DMA3_CH31_DriverIRQHandler
DMA4_ERROR_DriverIRQHandler
DMA4_CH0_CH1_CH32_CH33_DriverIRQHandler
DMA4_CH2_CH3_CH34_CH35_DriverIRQHandler
DMA4_CH4_CH5_CH36_CH37_DriverIRQHandler
DMA4_CH6_CH7_CH38_CH39_DriverIRQHandler
DMA4_CH8_CH9_CH40_CH41_DriverIRQHandler
DMA4_CH10_CH11_CH42_CH43_DriverIRQHandler
DMA4_CH12_CH13_CH44_CH45_DriverIRQHandler
DMA4_CH14_CH15_CH46_CH47_DriverIRQHandler
DMA4_CH16_CH17_CH48_CH49_DriverIRQHandler
DMA4_CH18_CH19_CH50_CH51_DriverIRQHandler
DMA4_CH20_CH21_CH52_CH53_DriverIRQHandler
DMA4_CH22_CH23_CH54_CH55_DriverIRQHandler
DMA4_CH24_CH25_CH56_CH57_DriverIRQHandler
DMA4_CH26_CH27_CH58_CH59_DriverIRQHandler
DMA4_CH28_CH29_CH60_CH61_DriverIRQHandler
DMA4_CH30_CH31_CH62_CH63_DriverIRQHandler
XBAR1_CH0_CH1_IRQHandler
XBAR1_CH2_CH3_IRQHandler
SINC3_CH0_CH1_CH2_CH3_IRQHandler
EWM_IRQHandler
SEMC_IRQHandler
LPIT3_IRQHandler
LPTMR3_IRQHandler
TMR4_IRQHandler
Reserved168_IRQHandler
LPI2C6_DriverIRQHandler
SAI4_DriverIRQHandler
SPDIF_DriverIRQHandler
Reserved172_IRQHandler
Reserved173_IRQHandler
Reserved174_IRQHandler
Reserved175_IRQHandler
INTG_BOOTROM_DEBUG_CTRL_IRQHandler
EDGELOCK_REQ1_IRQHandler
EDGELOCK_REQ2_IRQHandler
EDGELOCK_REQ3_IRQHandler
TMR3_IRQHandler
JTAGC_IRQHandler
M33_SYSRESET_REQ_IRQHandler
M33_LOCKUP_IRQHandler
M7_SYSRESET_REQ_IRQHandler
M7_LOCKUP_IRQHandler
PWM2_FAULT_IRQHandler
PWM2_0_IRQHandler
PWM2_1_IRQHandler
PWM2_2_IRQHandler
PWM2_3_IRQHandler
PWM3_FAULT_IRQHandler
PWM3_0_IRQHandler
PWM3_1_IRQHandler
PWM3_2_IRQHandler
PWM3_3_IRQHandler
PWM4_FAULT_IRQHandler
PWM4_0_IRQHandler
PWM4_1_IRQHandler
PWM4_2_IRQHandler
PWM4_3_IRQHandler
EQDC1_IRQHandler
EQDC2_IRQHandler
EQDC3_IRQHandler
EQDC4_IRQHandler
ADC2_IRQHandler
DCDC_IRQHandler
CAN3_DriverIRQHandler
CAN3_ERROR_DriverIRQHandler
DAC_IRQHandler
LPSPI5_DriverIRQHandler
LPSPI6_DriverIRQHandler
LPUART7_DriverIRQHandler
LPUART8_DriverIRQHandler
SAI2_DriverIRQHandler
Reserved215_IRQHandler
Reserved216_IRQHandler
Reserved217_IRQHandler
ACMP3_IRQHandler
Reserved219_IRQHandler
CM7_PS_IRQHandler
CM7_MCM_IRQHandler
CM33_MCM_IRQHandler
Reserved223_IRQHandler
SAFETY_CLK_MON_IRQHandler
GPT1_IRQHandler
GPT2_IRQHandler
KPP_IRQHandler
USBPHY1_IRQHandler
Reserved229_IRQHandler
Reserved230_IRQHandler
USB_OTG1_IRQHandler
FLEXSPI_SLV_DriverIRQHandler
NETC_IRQHandler
MSGINTR1_IRQHandler
MSGINTR2_IRQHandler
MSGINTR3_IRQHandler
MSGINTR4_IRQHandler
MSGINTR5_IRQHandler
MSGINTR6_IRQHandler
SINC1_CH0_IRQHandler
SINC1_CH1_IRQHandler
SINC1_CH2_IRQHandler
SINC1_CH3_IRQHandler
SINC2_CH0_IRQHandler
SINC2_CH1_IRQHandler
SINC2_CH2_IRQHandler
SINC2_CH3_IRQHandler
GPIO4_IRQHandler
TMR2_IRQHandler
GPIO5_IRQHandler
ASRC_DriverIRQHandler
GPIO6_IRQHandler
DBG_TRACE_IRQHandler
Reserved254_IRQHandler
DefaultISR
        B DefaultISR

        END
